package org.example;
/*
Реализовать калькулятор вкладов - на вход приложение получает сумму вклада в рублях (может быть дробной, например, 1450.85 рублей),
количество месяцев вклада (целое число) и годовой процент (может быть дробным, например, 14,5).
На выходе программа должна выдать сумму на вкладе, которая у клиента будет через указанное количество месяцев.
Причем считаем, что капитализация вклада происходит каждый месяц - то есть, по истечении каждого месяца клиенту
выплачиваются на счет проценты за прошедший месяц.
 */
public class Main {
    public static void main(String[] args) {

    }
}